#include "chinesenamebuilder.h"
#include <QtDebug>
#include <QFile>
#include <QRandomGenerator>

ChineseNameBuilder::ChineseNameBuilder(bool sw, bool singleName, bool boy):QObject(nullptr),
    singleXing(sw),
    singleName(singleName),
    boy(boy)
{
    // 男子名字集合
//    doubleWordName[0].insert("伟", "志伟|建伟|宏伟|大伟|晓伟|伟明|伟杰|伟民|伟伟|国伟|伟东|伟强|伟华|红伟|伟峰|小伟|洪伟|伟平|"
//                                 "俊伟|伟国|立伟|伟忠|伟军|华伟|文伟|军伟|伟光|明伟|世伟|佳伟|庆伟|忠伟|伟锋|永伟|振伟|新伟|"
//                                 "伟斌|正伟|继伟|金伟|伟良|光伟|成伟|伟雄|东伟|亚伟|嘉伟|雄伟|中伟|家伟|学伟|德伟|伟刚|智伟|"
//                                 "少伟|伟文|伟林|伟荣|春伟|伟成|伟涛|海伟|长伟|伟龙|广伟|荣伟|玉伟|江伟|伟江|利伟|伟波|兴伟|"
//                                 "健伟|伟健|伟新|伟超|伟宏|伟鹏|伟康|英伟|士伟|伟生|伟俊|伟亮|树伟|传伟|伟建|宗伟|延伟|昌伟|"
//                                 "兆伟|伟祥|伟中|彦伟|祥伟|伟达|敬伟|伟栋|胜伟|伟敏|伟庆|伟清");
//    doubleWordName[0].insert("勇", "志勇|智勇|小勇|大勇|建勇|勇军|晓勇|文勇|勇刚|海勇|勇强|国勇|立勇|德勇|金勇|学勇|勇华|长勇|继勇|世勇|明勇|正勇|"
//                                 "振勇|勇杰|庆勇|成勇|少勇|俊勇|士勇|家勇|勇平|华勇|克勇|新勇|兆勇|胜勇|春勇|传勇|慧勇|勇明|祥勇|勇斌|伟勇|光勇|"
//                                 "义勇|勇峰|勇辉|方勇|利勇|勇波|勇兵|道勇|剑勇|朝勇|培勇|军勇|绍勇|广勇|忠勇|兴勇|勇伟|勇飞|万勇|先勇|昌勇|维勇|"
//                                 "勇智|江勇|勇涛|良勇|仁勇|玉勇|永勇|勇胜|树勇|洪勇|瑞勇|泽勇|勇志|其勇|善勇|勇超|勇进|开勇|会勇|林勇|书勇|勤勇|"
//                                 "勇勇|桂勇|怀勇|占勇|红勇|健勇|向勇|连勇|天勇|全勇|进勇|福勇|吉勇|勇生|爱勇|雪勇|孝勇|启勇|承勇|云勇|仕勇|加勇|"
//                                 "勇锋|宏勇|卫勇|子勇|英勇|勇林|亚勇");
//    doubleWordName[0].insert("军", "建军|海军|志军|小军|学军|晓军|红军|文军|亚军|立军|永军|国军|利军|爱军|拥军|铁军|"
//                                 "卫军|德军|勇军|明军|洪军|玉军|伟军|军华|继军|华军|军伟|庆军|世军|宝军|新军|正军|"
//                                 "军辉|成军|广军|彦军|艳军|军民|向军|长军|少军|延军|大军|荣军|进军|振军|军军|保军|"
//                                 "福军|树军|冠军|胜军|占军|培军|万军|宏军|连军|军强|传军|士军|军平|维军|瑞军|兴军|"
//                                 "兆军|军峰|义军|武军|跃军|良军|光军|军锋|朝军|军明|林军|秀军|军生|军杰|会军|友军|"
//                                 "克军|军涛|智军|燕军|力军|启军|守军|益军|治军|凤军|绍军|祥军|家军|喜军|贵军|东军|"
//                                 "桂军|忠军|怀军|泽军|军海|丽军|汉军|先军|昌军|惠军|耀军|道军|军波|雪军");
//    doubleWordName[0].insert("磊", "晓磊|磊磊|小磊|明磊|石磊|光磊|玉磊|鑫磊|建磊|志磊|文磊|金磊|洪磊|海磊|宏磊|庆磊|红磊|永磊|春磊|"
//                                 "大磊|亚磊|国磊|世磊|晶磊|佳磊|广磊|新磊|磊明|宝磊|东磊|学磊|兴磊|振磊|兆磊|成磊|磊杰|俊磊|少磊|"
//                                 "继磊|士磊|华磊|正磊|长磊|绍磊|传磊|彦磊|保磊|家磊|昌磊|高磊|立磊|旭磊|军磊|书磊|智磊|祥磊|万磊|"
//                                 "星磊|忠磊|云磊|凯磊|磊峰|江磊|敬磊|克磊|延磊|占磊|英磊|恒磊|培磊|一磊|吉磊|宗磊|鸿磊|树磊|德磊|"
//                                 "磊军|浩磊|磊波|鹏磊|雪磊|中磊|磊光|守磊|加磊|岩磊|欣磊|道磊|相磊|铭磊|磊强|同磊|磊刚|义磊|胜磊|"
//                                 "方磊|贤磊|嘉磊|阳磊|启磊|福磊|铁磊|希磊|磊鑫|亦磊|晨磊|秀磊|张磊");
//    doubleWordName[0].insert("涛", "海涛|洪涛|文涛|江涛|松涛|永涛|建涛|红涛|金涛|云涛|宏涛|志涛|俊涛|玉涛|晓涛|振涛|国涛|波涛|明涛|春涛|伟涛|涛涛|"
//                                 "庆涛|林涛|小涛|军涛|广涛|立涛|景涛|锦涛|鹏涛|延涛|彦涛|亚涛|新涛|光涛|东涛|正涛|兴涛|运涛|雪涛|静涛|学涛|继涛|"
//                                 "维涛|龙涛|忠涛|世涛|敬涛|传涛|清涛|成涛|旭涛|卫涛|长涛|勇涛|胜涛|瑞涛|艳涛|剑涛|利涛|京涛|鸿涛|福涛|华涛|英涛|"
//                                 "连涛|祥涛|泽涛|宗涛|荣涛|万涛|占涛|德涛|汉涛|启涛|宇涛|家涛|培涛|元涛|树涛|智涛|书涛|润涛|凤涛|会涛|士涛|子涛|"
//                                 "向涛|中涛|炳涛|克涛|宪涛|桂涛|劲涛|大涛|增涛|凌涛|秀涛|银涛|峰涛|伯涛|慧涛|恒涛|吉涛|义涛");
//    doubleWordName[0].insert("斌", "文斌|志斌|晓斌|海斌|建斌|国斌|宏斌|洪斌|学斌|斌斌|永斌|伟斌|红斌|小斌|玉斌|立斌|亚斌|彦斌|"
//                                 "德斌|华斌|利斌|鸿斌|继斌|家斌|世斌|成斌|卫斌|庆斌|荣斌|慧斌|智斌|传斌|俊斌|振斌|剑斌|佳斌|"
//                                 "斌华|勇斌|瑞斌|忠斌|广斌|武斌|少斌|延斌|长斌|爱斌|维斌|汉斌|良斌|旭斌|耀斌|启斌|贤斌|贵斌|"
//                                 "义斌|祥斌|正斌|绍斌|承斌|树斌|兆斌|惠斌|兴斌|艳斌|斌峰|斌杰|云斌|守斌|泽斌|克斌|春斌|秀斌|"
//                                 "仁斌|新斌|燕斌|健斌|英斌|子斌|善斌|光斌|益斌|万斌|会斌|宇斌|大斌|胜斌|毅斌|林斌|宗斌|龙斌|"
//                                 "昌斌|道斌|祖斌|朝斌|嘉斌|斌辉|恒斌|景斌|孝斌|治斌|福斌|有斌|士斌|亦斌|喜斌|雁斌|浩斌|跃斌|"
//                                 "怀斌|育斌|书斌|东斌|元斌|雪斌|金斌|晋斌");
//    doubleWordName[0].insert("强", "志强|国强|永强|建强|伟强|文强|小强|晓强|立强|富强|德强|自强|明强|玉强|海强|世强|智强|勇强|振强|利强|华强|学强|俊强|新强|军强|洪强|克强|卫强|"
//                                 "强强|福强|正强|金强|树强|忠强|胜强|瑞强|家强|坚强|维强|红强|力强|宏强|加强|刚强|增强|荣强|继强|春强|宝强|中强|健强|光强|子强|兴强|士强|成强|"
//                                 "强华|亚强|广强|敏强|云强|大强|治强|少强|宗强|民强|林强|惠强|培强|祖强|庆强|东强|会强|万强|绍强|兆强|义强|雪强|秀强|保强|毅强|顺强|桂强|浩强|"
//                                 "高强|耀强|炳强|跃强|守强|书强|旭强|泽强|汉强|仁强|龙强|武强|进强|铁强|贵强|友强|延强|发强|思强|运强|占强|茂强|月强|有强|传强|英强|厚强|锡强|"
//                                 "强军|启强|慧强|凯强|彦强");

//    // 女子名字集合
//    doubleWordName[1].insert("伟", "伟华|宏伟|伟伟|伟芳|伟娜|伟红|红伟|晓伟|伟丽|伟娟|伟英|伟萍|伟芳|伟娜|伟玲|建伟|志伟|伟平");
//    doubleWordName[1].insert("军", "亚军|爱军|晓军|军霞|利军|学军|艳军");
//    doubleWordName[1].insert("磊", "晓磊|磊磊|小磊|文磊|明磊|玉磊|鑫磊|红磊|春磊|晶磊");
//    doubleWordName[1].insert("涛", "海涛|文涛|金涛|涛涛|晓涛|雪涛|红涛|春涛|江涛|洪涛|玉涛|云涛");
//    doubleWordName[1].insert("斌", "斌斌|文斌");
}

const QString ChineseNameBuilder::build()
{
    QFile file(singleXing ? "://res/strings/xingS" : "://res/strings/xingD");
    if (!file.open(QIODevice::ReadOnly)) {
        return "";
    }

    QTextStream in(&file);
    QString xing = in.readAll();
    QRandomGenerator rand(0);
    quint32 i = rand.generate();
    QString randXing = xing.at(i);

    return randXing;
}

